app/controllers/accesos_controller.rb

  def index
    @accesos = Acceso.all
---
SELECT * FROM "accesos"

  def show
    @acceso = Acceso.find(params[:id])
---
SELECT * FROM "accesos" WHERE ("accesos"."id" = 5)

  def create
    @acceso = Acceso.new(params[:acceso])

    respond_to do |format|
      if @acceso.save
---
INSERT INTO "accesos" ("created_at", "updated_at", "descripcion") VALUES('2010-06-20 04:17:13', '2010-06-20 04:17:13', 'permanentes')

  def destroy
    @acceso = Acceso.find(params[:id])
    @acceso.destroy
---
SELECT * FROM "accesos" WHERE ("accesos"."id" = 1)
DELETE FROM "accesos" WHERE "id" = 1