app/controllers/adquis_controller.rb

  def index
    @adquis = Adqui.all
---
SELECT * FROM "adquis"

  def show
    @adqui = Adqui.find(params[:id])
---
SELECT * FROM "adquis" WHERE ("adquis"."id" = 1)

  def edit
    @adqui = Adqui.find(params[:id])
---
SELECT * FROM "adquis" WHERE ("adquis"."id" = 1)

  def update
    @adqui = Adqui.find(params[:id])

    respond_to do |format|
      if @adqui.update_attributes(params[:adqui])
---
SELECT * FROM "adquis" WHERE ("adquis"."id" = 1)
UPDATE "adquis" SET "updated_at" = '2010-06-20 16:11:33', "descripcion" = 'herencia' WHERE "id" = 1