app/controllers/aguas_controller.rb

  def index
    @aguas = Agua.all
---
SELECT * FROM "aguas"

  def show
    @agua = Agua.find(params[:id])
---
SELECT * FROM "aguas" WHERE ("aguas"."id" = 1)

  def edit
    @agua = Agua.find(params[:id])
---
SELECT * FROM "aguas" WHERE ("aguas"."id" = 1)

  def update
    @agua = Agua.find(params[:id])

    respond_to do |format|
      if @agua.update_attributes(params[:agua])
---
SELECT * FROM "aguas" WHERE ("aguas"."id" = 1)
UPDATE "aguas" SET "updated_at" = '2010-06-20 16:13:01', "descripcion" = 'pozo' WHERE "id" = 1