app/controllers/alfabes_controller.rb

  def index
    @alfabes = Alfabe.all
---
SELECT * FROM "alfabes"

  def show
    @alfabe = Alfabe.find(params[:id])
---
SELECT * FROM "alfabes" WHERE ("alfabes"."id" = 1)

  def create
    @alfabe = Alfabe.new(params[:alfabe])

    respond_to do |format|
      if @alfabe.save
---
INSERT INTO "alfabes" ("created_at", "updated_at", "descripcion") VALUES('2010-06-20 16:37:44', '2010-06-20 16:37:44', 'Sí')