app/controllers/color_suelos_controller.rb

  def index
    @color_suelos = ColorSuelo.all
---
SELECT * FROM "color_suelos"

  def show
    @color_suelo = ColorSuelo.find(params[:id])
---
SELECT * FROM "color_suelos" WHERE ("color_suelos"."id" = 1)

  def edit
    @color_suelo = ColorSuelo.find(params[:id])
---
SELECT * FROM "color_suelos" WHERE ("color_suelos"."id" = 1)

  def create
    @color_suelo = ColorSuelo.new(params[:color_suelo])

    respond_to do |format|
      if @color_suelo.save
---
INSERT INTO "color_suelos" ("created_at", "updated_at", "descripcion") VALUES('2010-06-20 02:12:18', '2010-06-20 02:12:18', 'Negro')

  def update
    @color_suelo = ColorSuelo.find(params[:id])

    respond_to do |format|
      if @color_suelo.update_attributes(params[:color_suelo])
---
SELECT * FROM "color_suelos" WHERE ("color_suelos"."id" = 1)
UPDATE "color_suelos" SET "updated_at" = '2010-06-20 02:12:33', "descripcion" = 'Amarillento' WHERE "id" = 1