app/controllers/comunidades_controller.rb

  def index
    @comunidades = Comunidade.all
---
SELECT * FROM "comunidades"

  def show
    @comunidade = Comunidade.find(params[:id])
---
SELECT * FROM "comunidades" WHERE ("comunidades"."id" = 1)

  def create
    @comunidade = Comunidade.new(params[:comunidade])

    respond_to do |format|
      if @comunidade.save
---
INSERT INTO "comunidades" ("created_at", "nombre", "updated_at") VALUES('2010-06-20 02:20:59', 'Dipilto', '2010-06-20 02:20:59')

  def destroy
    @comunidade = Comunidade.find(params[:id])
    @comunidade.destroy
---
SELECT * FROM "comunidades" WHERE ("comunidades"."id" = 1)
DELETE FROM "comunidades" WHERE "id" = 1