app/controllers/fertilizas_controller.rb

  def index
    @fertilizas = Fertiliza.all
---
SELECT * FROM "fertilizas"

  def show
    @fertiliza = Fertiliza.find(params[:id])
---
SELECT * FROM "fertilizas" WHERE ("fertilizas"."id" = 1)

  def edit
    @fertiliza = Fertiliza.find(params[:id])
---
SELECT * FROM "fertilizas" WHERE ("fertilizas"."id" = 1)

  def create
    @fertiliza = Fertiliza.new(params[:fertiliza])

    respond_to do |format|
      if @fertiliza.save
---
INSERT INTO "fertilizas" ("created_at", "updated_at", "descripcion") VALUES('2010-06-20 02:15:54', '2010-06-20 02:15:54', 'sí')

  def update
    @fertiliza = Fertiliza.find(params[:id])

    respond_to do |format|
      if @fertiliza.update_attributes(params[:fertiliza])
---
SELECT * FROM "fertilizas" WHERE ("fertilizas"."id" = 1)
UPDATE "fertilizas" SET "updated_at" = '2010-06-20 16:13:54', "descripcion" = 'Sí' WHERE "id" = 1