app/controllers/fincas_controller.rb

SELECT * FROM "fincas"
---
  def index
    @fincas = Finca.all

SELECT * FROM "fincas" WHERE ("fincas"."id" = 2)
---
  def show
    @finca = Finca.find(params[:id])

SELECT * FROM "fincas" WHERE ("fincas"."id" = 6)
---
  def edit
    @finca = Finca.find(params[:id])

INSERT INTO "fincas" ("area_agric", "lon", "agua_id", "created_at", "municipio_id", "acceso_id", "invier_acceso_id", "comunidad_id", "profun_suelo_id", "updated_at", "descripcion", "area_bosque", "adqui_id", "verano_acceso_id", "color_suelo_id", "area_tot", "altura", "fertiliza_id", "area_cafe", "area_potrero", "topogra_id", "lat", "tipo_suelo_id", "area_guat") VALUES(NULL, NULL, NULL, '2010-06-19 17:15:15', NULL, NULL, NULL, NULL, NULL, '2010-06-19 17:15:15', 'Finca la monda', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
---
  def create
    puts "XXXXXXXXXXXXXXXXXXX"
    p params[:finca]
    puts "OOOOOOOOOOOOOOOOOOO"
    @finca = Finca.new(params[:finca])
    respond_to do |format|
      if @finca.save

SELECT * FROM "fincas" WHERE ("fincas"."id" = 7)
UPDATE "fincas" SET "updated_at" = '2010-06-20 04:07:40', "area_cafe" = 25, "area_bosque" = 14, "area_agric" = 12 WHERE "id" = 1
---
  def update
    params[:finca][:existing_persona_attributes] ||= {}
    puts "*****************"
        puts params
        puts "-----------------"
    @finca = Finca.find(params[:id])

    respond_to do |format|
      if @finca.update_attributes(params[:finca])

SELECT * FROM "fincas" WHERE ("fincas"."id" = 1)
DELETE FROM "fincas" WHERE "id" = 1
---
  def destroy
    @finca = Finca.find(params[:id])
    @finca.destroy