app/controllers/fotos_controller.rb

SELECT * FROM "fotos"
---
  def index
    @fotos = Foto.all

SELECT * FROM "fotos" WHERE ("fotos"."id" = 1)
---
  def show
    @foto = Foto.find(params[:id])

SELECT * FROM "fotos" WHERE ("fotos"."id" = 1)
---
  def edit
    @foto = Foto.find(params[:id])

INSERT INTO "fotos" ("lon", "created_at", "titulo", "updated_at", "url", "finca_id", "lat") VALUES('2', '2010-06-21 00:33:08', 'Potrero', '2010-06-21 00:33:08', 'finca003.jpg', 1, '1')
---
  def create
    @foto = Foto.new(params[:foto])

    respond_to do |format|
      if @foto.save

SELECT * FROM "fotos" WHERE ("fotos"."id" = 1)
UPDATE "fotos" SET "updated_at" = '2010-06-21 01:25:29', "titulo" = 'Cruce de caminos' WHERE "id" = 2
---
  def update
    @foto = Foto.find(params[:id])

    respond_to do |format|
      if @foto.update_attributes(params[:foto])