app/controllers/generos_controller.rb

  def index
    @generos = Genero.all
---
SELECT * FROM "generos"

  def show
    @genero = Genero.find(params[:id])
---
SELECT * FROM "generos" WHERE ("generos"."id" = 1)

  def create
    @genero = Genero.new(params[:genero])

    respond_to do |format|
      if @genero.save
---
INSERT INTO "generos" ("created_at", "updated_at", "descripcion") VALUES('2010-06-20 16:34:46', '2010-06-20 16:34:46', 'Mujer')