app/controllers/nacionas_controller.rb

  def index
    @nacionas = Naciona.all
---
SELECT * FROM "nacionas"

  def show
    @naciona = Naciona.find(params[:id])
---
SELECT * FROM "nacionas" WHERE ("nacionas"."id" = 1)

  def edit
    @naciona = Naciona.find(params[:id])
---
SELECT * FROM "nacionas" WHERE ("nacionas"."id" = 1)

  def create
    @naciona = Naciona.new(params[:naciona])

    respond_to do |format|
      if @naciona.save
---
INSERT INTO "nacionas" ("created_at", "updated_at", "descripcion") VALUES('2010-06-20 16:35:55', '2010-06-20 16:35:55', 'Nicaragüense')