app/controllers/openmapas_controller.rb

  def index
    @openmapas = Openmapa.all
---
SELECT * FROM "openmapas"

  def show
    @openmapa = Openmapa.find(params[:id])
---
SELECT * FROM "openmapas" WHERE ("openmapas"."id" = 1)

  def edit
    @openmapa = Openmapa.find(params[:id])
---
SELECT * FROM "openmapas" WHERE ("openmapas"."id" = 1)

  def create
    @openmapa = Openmapa.new(params[:openmapa])

    respond_to do |format|
      if @openmapa.save
---
INSERT INTO "openmapas" ("created_at", "municipio_id", "updated_at", "codigo_html") VALUES('2010-06-21 20:43:57', 1, '2010-06-21 20:43:57', '<iframe width="425" height="350" frameborder="0" scrolling="no" marginheight="0" marginwidth="0" src="http://www.openstreetmap.org/export/embed.html?bbox=-86.5769,13.7536,-86.5251,13.8012&layer=mapnik" style="border: 1px solid black"></iframe><br /><small><a href="http://www.openstreetmap.org/?lat=13.7774&lon=-86.551&zoom=13&layers=B000FTFT">View Larger Map</a></small>')

  def update
    @openmapa = Openmapa.find(params[:id])

    respond_to do |format|
      if @openmapa.update_attributes(params[:openmapa])
---
SELECT * FROM "openmapas" WHERE ("openmapas"."id" = 1)
UPDATE "openmapas" SET "updated_at" = '2010-06-21 21:10:09', "codigo_html" = '<iframe width="425" height="350" frameborder="0" scrolling="no" marginheight="0" marginwidth="0" src="http://www.openstreetmap.org/export/embed.html?bbox=-86.5769,13.7536,-86.5251,13.8012&layer=mapnik" style="border: 1px solid black"></iframe><br /><small><a href="http://www.openstreetmap.org/?lat=13.7774&lon=-86.551&zoom=13&layers=B000FTFT">Ver el mapa más grande</a></small>' WHERE "id" = 1