app/controllers/parentescos_controller.rb

SELECT * FROM "parentescos"
---
  def index
    @parentescos = Parentesco.all

SELECT * FROM "parentescos" WHERE ("parentescos"."id" = 1)
---
  def show
    @parentesco = Parentesco.find(params[:id])

INSERT INTO "parentescos" ("created_at", "updated_at", "descripcion") VALUES('2010-06-20 16:43:06', '2010-06-20 16:43:06', 'Hijo')
---
  def create
    @parentesco = Parentesco.new(params[:parentesco])

    respond_to do |format|
      if @parentesco.save