app/controllers/personas_controller.rb

SELECT * FROM "personas"
---
  def index
    @personas = Persona.all

SELECT * FROM "personas" WHERE ("personas"."id" = 3)
---
  def show
    @persona = Persona.find(params[:id])

SELECT * FROM "personas" WHERE ("personas"."id" = 3)
---
  def edit
    @persona = Persona.find(params[:id])

SELECT * FROM "personas" WHERE ("personas"."id" = 3)
UPDATE "personas" SET "direccion" = '', "updated_at" = '2010-06-19 20:30:11', "cabeza_familia" = 't', "fecha_nac" = '2010-06-19', "apellido2" = '', "nombre2" = '', "apellido1" = '' WHERE "id" = 3
---
  def update
    @persona = Persona.find(params[:id])

    respond_to do |format|
      if @persona.update_attributes(params[:persona])

SELECT * FROM "personas" WHERE ("personas"."id" = 3)
DELETE FROM "personas" WHERE "id" = 3
---
  def destroy
    @persona = Persona.find(params[:id])
    @persona.destroy