app/controllers/profesions_controller.rb

  def index
    @profesions = Profesion.all
---
SELECT * FROM "profesions"

  def show
    @profesion = Profesion.find(params[:id])
---
SELECT * FROM "profesions" WHERE ("profesions"."id" = 1)

  def edit
    @profesion = Profesion.find(params[:id])
---
SELECT * FROM "profesions" WHERE ("profesions"."id" = 2)

  def create
    @profesion = Profesion.new(params[:profesion])

    respond_to do |format|
      if @profesion.save
---
INSERT INTO "profesions" ("created_at", "updated_at", "descripcion") VALUES('2010-06-20 16:40:33', '2010-06-20 16:40:33', 'Agricultor')

  def update
    @profesion = Profesion.find(params[:id])

    respond_to do |format|
      if @profesion.update_attributes(params[:profesion])
---
SELECT * FROM "profesions" WHERE ("profesions"."id" = 2)
UPDATE "profesions" SET "updated_at" = '2010-06-20 16:41:03', "descripcion" = 'Electricista' WHERE "id" = 2