app/controllers/profun_suelos_controller.rb

SELECT * FROM "profun_suelos"
---
  def index
    @profun_suelos = ProfunSuelo.all

SELECT * FROM "profun_suelos" WHERE ("profun_suelos"."id" = 1)
---
  def show
    @profun_suelo = ProfunSuelo.find(params[:id])

INSERT INTO "profun_suelos" ("created_at", "updated_at", "descripcion") VALUES('2010-06-20 02:10:19', '2010-06-20 02:10:19', '10 cm')
---
  def create
    @profun_suelo = ProfunSuelo.new(params[:profun_suelo])

    respond_to do |format|
      if @profun_suelo.save