app/controllers/topogras_controller.rb

SELECT * FROM "topogras"
---
  def index
    @topogras = Topogra.all

SELECT * FROM "topogras" WHERE ("topogras"."id" = 1)
---
  def show
    @topogra = Topogra.find(params[:id])

INSERT INTO "topogras" ("created_at", "updated_at", "descripcion") VALUES('2010-06-20 02:14:15', '2010-06-20 02:14:15', 'plano')
---
  def create
    @topogra = Topogra.new(params[:topogra])

    respond_to do |format|
      if @topogra.save